REPORT.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-05 Fri 15:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Caio Rodrigues Soares Silva" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3cd404c">1. Report</a>
<ul>
<li><a href="#orga97160e">1.1. F# Fsharp (.NET) bindings for GNU Scientific Library (GSL)</a>
<ul>
<li><a href="#orgc2763bf">1.1.1. Overview</a></li>
<li><a href="#org9b6e2c4">1.1.2. Files</a></li>
<li><a href="#org2cdb55b">1.1.3. References</a></li>
<li><a href="#org221ff99">1.1.4. Building</a></li>
<li><a href="#orgafb8521">1.1.5. Examples</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3cd404c" class="outline-2">
<h2 id="org3cd404c"><span class="section-number-2">1</span> Report</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga97160e" class="outline-3">
<h3 id="orga97160e"><span class="section-number-3">1.1</span> F# Fsharp (.NET) bindings for GNU Scientific Library (GSL)</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc2763bf" class="outline-4">
<h4 id="orgc2763bf"><span class="section-number-4">1.1.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
This example shows how to create access native code (shared libraries)
with Pinvoke in F#.
</p>
</div>
</div>

<div id="outline-container-org9b6e2c4" class="outline-4">
<h4 id="org9b6e2c4"><span class="section-number-4">1.1.2</span> Files</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="gsl.fsx">file:gsl.fsx</a> - F# source code of gsl.dll - Library</li>

<li><a href="gslAdapter.c">file:gslAdapter.c</a> - Adapter for library GSL - Gnu Scientifc
Library providing an FFI-friendly interface for GSL through void*
pointers to C structs.</li>

<li><a href="Makefile">file:Makefile</a> - Makefile recipes to build the F# library
(gsl.dll) and the native shared library (dynamic library)
gslAdapter.so.</li>
</ul>
</div>
</div>

<div id="outline-container-org2cdb55b" class="outline-4">
<h4 id="org2cdb55b"><span class="section-number-4">1.1.3</span> References</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gsl/manual/html_node/index.html#Top">GNU Scientific Library – Reference Manual: Top</a></li>

<li><a href="https://www.lrz.de/services/software/mathematik/gsl/gsl-ref-116.pdf">GNU Scientific Library</a> - PDF Reference Manual</li>

<li><a href="http://www.mas.ncl.ac.uk/~ndjw1/teaching/sim/gsl.html">Getting started with GSL</a></li>

<li><a href="https://www.physics.ohio-state.edu/~ntg/780/gsl_examples/">Sample Codes Using GSL Routines</a></li>

<li><a href="http://www.courses.physics.helsinki.fi/fys/cprog/lectures/12-gsl.pdf">Scientific Programming in C XII. GNU Scientific Library</a></li>
</ul>
</div>
</div>

<div id="outline-container-org221ff99" class="outline-4">
<h4 id="org221ff99"><span class="section-number-4">1.1.4</span> Building</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
To build the library run <code>$ make gsl</code>. 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ make gsl
gcc gslAdapter.c -o <span class="org-keyword">libGslAdapter.so</span> -Wall -shared -fpic -lgsl -lgslcblas -lm 
fsharpc gsl.fsx --out:gsl.dll --target:library
F# Compiler for F# 4.1
Freely distributed under the Apache 2.0 Open Source License

$ file libGslAdapter.so 
<span class="org-function-name">libGslAdapter.so</span>: ELF 64-bit LSB shared object, x86-64, version 1 (SYSV), dynamically linked, <span class="org-variable-name">BuildID</span>[sha1]=ac05836b1ed610f8d5b37e9f202792850d94d6f4, not stripped, with debug_info

$ file gsl.dll 
<span class="org-function-name">gsl.dll</span>: PE32 executable (DLL) (console) Intel 80386 Mono/.Net assembly, for MS Windows
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafb8521" class="outline-4">
<h4 id="orgafb8521"><span class="section-number-4">1.1.5</span> Examples</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Basic Functions
</p>

<div class="org-src-container">
<pre class="src src-fsharp">- Gsl.Basic.log1p 100.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 4.615120517
&gt; 

- Gsl.Basic.hypot(60.0, 80.0) ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 100.0

&gt; Gsl.Basic.hypot(6.0, 8.0) ;;  
<span class="org-keyword">val</span> i

- [(3.0, 4.0) ; (6.0, 8.0) ; (60.0, 80.0)] |&gt; List.map Gsl.Basic.hypot ;;- 
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double list</span> = [5.0; 10.0; 100.0]
&gt; 


</pre>
</div>

<p>
Polynomial functions
</p>

<div class="org-src-container">
<pre class="src src-fsharp">- <span class="org-keyword">module</span> <span class="org-type">Poly</span> = Gsl.Poly ;;
&gt; 
- <span class="org-keyword">let</span> poly1 = Poly.polyEval [1.0 ; 2.0; 3.0; 4.0 ] ;;

<span class="org-keyword">val</span> poly1 : (double -&gt; double)

&gt; poly1 1.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 10.0
&gt; poly1 (-1.0) ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = -2.0
&gt; 

- <span class="org-keyword">let</span> <span class="org-function-name">f</span> x = 1. + 2.0 * x + 3.0 * x**2.0 + 4.0 * x**3.0 ;;

<span class="org-keyword">val</span> <span class="org-variable-name">f</span> : <span class="org-type">x:</span>float -&gt; float

&gt; f 1.0 ;;                                               
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">float</span> = 10.0
&gt; 
- f -1.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">float</span> = -2.0
&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Solve: x^2 - 25.0 = 0 </span>
<span class="org-comment-delimiter">//</span>
- Poly.solveQuadratic 1.0 0.0 -25.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">float list</span> = [-5.0; 5.0]
&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Solve: x^2 - 25.0 = 0 </span>
<span class="org-comment-delimiter">//</span>
- Poly.solveQuadratic 1.0 0.0 25.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">float list</span> = []
&gt; 


<span class="org-comment-delimiter">// </span><span class="org-comment">Solve</span>
<span class="org-comment-delimiter">//        </span><span class="org-comment">3 * (x - 3)(x - 4)    = 0 </span>
<span class="org-comment-delimiter">//        </span><span class="org-comment">3 * (x ^ 2 - 7x + 12) = 0 </span>
<span class="org-comment-delimiter">//        </span><span class="org-comment">3*x^2 -21*x + + 36    = 0</span>
<span class="org-comment-delimiter">//</span>
<span class="org-comment-delimiter">//        </span><span class="org-comment">a = 3, b = -21, c = 36</span>
&gt; Poly.solveQuadratic 3. -21. 36. ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">float list</span> = [3.0; 4.0]
&gt; 


</pre>
</div>

<p>
Bessel Functions 
</p>

<div class="org-src-container">
<pre class="src src-fsharp">- Gsl.Bessel.besselJ0 0.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 1.0

&gt; Gsl.Bessel.besselJ0 1.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 0.7651976866
&gt; 

</pre>
</div>

<p>
Complex numbers 
</p>

<div class="org-src-container">
<pre class="src src-fsharp">$ make gsl &amp;&amp; env LD_LIBRARY_PATH=. fsharpi -r:<span class="org-type">gsl.</span>dll
<span class="org-function-name">make</span>: Nothing <span class="org-keyword">to</span> be <span class="org-keyword">done</span> <span class="org-keyword">for</span> 'gsl'.

F# Interactive <span class="org-keyword">for</span> F# 4.1
Freely distributed under the Apache 2.0 Open Source License

For help <span class="org-keyword">type</span> <span class="org-keyword">#help</span>;;

&gt; 
- <span class="org-keyword">module</span> <span class="org-type">Cpl</span> = Gsl.Cpl ;;
&gt; 
- <span class="org-keyword">let</span> a = Cpl.rect 10.0 20.0 
- <span class="org-keyword">let</span> b = Cpl.rect 40.0 25.0
- <span class="org-keyword">let</span> c = Cpl.rect 100.0 0.0
- ;;

<span class="org-keyword">val</span> <span class="org-variable-name">a</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">10.</span>000000 + 20.000000j
<span class="org-keyword">val</span> <span class="org-variable-name">b</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">40.</span>000000 + 25.000000j
<span class="org-keyword">val</span> <span class="org-variable-name">c</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">100.</span>000000 + 0.000000j

&gt; a.GetReal() ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 10.0
&gt; a.GetImag() ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double</span> = 20.0
&gt; a.ToTupleRect() ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">double *</span> double = (10.0, 20.0)
&gt; 

&gt; 10.0 + a ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">20.</span>000000 + 20.000000j
&gt; 
- a - 10.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">0.</span>000000 + 20.000000j
&gt; 
- a * b ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: -100.000000 + 1050.000000j
&gt; 
- a - b ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: -30.000000 + -5.000000j
&gt; 
- b / a ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">1.</span>800000 + -1.100000j
&gt; 
- b ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">40.</span>000000 + 25.000000j
&gt; 
- b / 10.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">4.</span>000000 + 2.500000j
&gt; 
- c ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">100.</span>000000 + 0.000000j
&gt; 
- c / 100.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">1.</span>000000 + 0.000000j
&gt; 
- 10.0 + c / 100.0 ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">11.</span>000000 + 0.000000j
&gt; 
- Cpl.sqrt c ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">10.</span>000000 + 0.000000j
&gt; 
- Cpl.log10 c ;;
<span class="org-keyword">val</span> <span class="org-variable-name">it</span> : <span class="org-type">Gsl.</span>Cpl.Cpl = Complex: <span class="org-type">2.</span>000000 + 0.000000j
&gt; 

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues Soares Silva</p>
<p class="date">Created: 2018-10-05 Fri 15:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
